// новый функционал для помощи, просто текст.
// первыя строка - название file11 - привязан к старой архитектуре
// unit-23 - принадлежность к уроку
// вторая строка - это начало помощи для конкретного языка (RU)
// Первый главный заголовок h2, перед текстом заголовка
// Добавлены h3, h4
// перед списком UL
// закрывается тег там, где встречает пустую строку

// Сама информация на нужном языке должна попасть в функцию getBodyThoury()

// каждый новый файл нужно прописать arrayDataThoury.js
// если нужен кастыль, то тут getBodyThoury

export function thouryUnit25()
{
    return `
    file46
    unit-25
    ru
h2
I’m going to … — выражение намерений и прогнозов

h3
Когда и где используется

h4
Конструкция be going to + глагол используется, когда мы говорим о планах, намерениях или будущих действиях, которые человек уже решил сделать (решение принято до момента речи).
Также be going to применяется для предсказаний, если есть видимые признаки, что что-то произойдёт.

h4
Употребляется, когда мы говорим о:

ul
личных планах и решениях (что собираемся сделать),
будущих изменениях,
ситуациях, где виден очевидный результат.

h4
Форма (Form)
am / is / are + going to + глагол (V₁)

ul
I’m going to study.
He’s going to work.
We’re going to travel.

h4
Отрицание:
am/is/are + not + going to + V
I’m not going to watch TV.

h4
Вопрос:
Am/Is/Are + subject + going to + V?
Are you going to call her?

h4
Когда используем “be going to”

h4
Намерения (Plans / Intentions)
Когда мы уже решили, что будем делать, но ещё не начали готовиться (нет точного времени, билета и т.д.)
I’m going to learn Polish. — Я собираюсь выучить польский.
We’re going to move to another city. — Мы собираемся переехать в другой город.

h4
Решение принято до момента речи.
Предсказания на основе фактов (Predictions based on evidence)
Когда видно, что что-то скоро произойдёт, и есть признаки этого.

h4
Look at those clouds — it’s going to rain. — Смотри, скоро пойдёт дождь.
He’s driving too fast — he’s going to crash! — Он едет слишком быстро — он сейчас врежется!

h4
Когда не используем “going to”
Когда решение принимается в момент речи — → will
I’m thirsty — I’ll get some water.

h4
Когда действие уже запланировано и организовано — → Present Continuous
I’m meeting Tom tomorrow. (договорено, есть время встречи)

h4
Как запомнить

ul
Going to — есть намерение или виден признак.
Present Continuous — уже организовано, назначено.
Will — решение прямо сейчас.

`}
